{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "UnLua Editor"
					},
					"Translation":
					{
						"Text": "UnLua 编辑器"
					},
					"Key": "UnLuaEditor"
				}
			]
		},
		{
			"Namespace": "FUnLuaEditorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Bind"
					},
					"Translation":
					{
						"Text": "绑定"
					},
					"Key": "Bind"
				},
				{
					"Source":
					{
						"Text": "Copy as Relative Path"
					},
					"Translation":
					{
						"Text": "复制相对路径"
					},
					"Key": "CopyAsRelativePath"
				},
				{
					"Source":
					{
						"Text": "Create Lua Template"
					},
					"Translation":
					{
						"Text": "创建Lua模版文件"
					},
					"Key": "CreateLuaTemplate"
				},
				{
					"Source":
					{
						"Text": "Lua file ({0}) is already existed!"
					},
					"Translation":
					{
						"Text": "Lua文件（{0}）已经存在"
					},
					"Key": "FileAlreadyExists"
				},
				{
					"Source":
					{
						"Text": "Please specify a module name first"
					},
					"Translation":
					{
						"Text": "请先指定模块名"
					},
					"Key": "ModuleNameRequired"
				},
				{
					"Source":
					{
						"Text": "Reveal in Explorer"
					},
					"Translation":
					{
						"Text": "在资源管理器中显示"
					},
					"Key": "RevealInExplorer"
				},
				{
					"Source":
					{
						"Text": "The file does not exist."
					},
					"Translation":
					{
						"Text": "文件不存在"
					},
					"Key": "FileNotExist"
				},
				{
					"Source":
					{
						"Text": "UnLua"
					},
					"Translation":
					{
						"Text": "UnLua"
					},
					"Key": "UnLua_Label"
				},
				{
					"Source":
					{
						"Text": "UnLua"
					},
					"Translation":
					{
						"Text": "UnLua"
					},
					"Key": "UnLua_ToolTip"
				},
				{
					"Source":
					{
						"Text": "UnLua Editor"
					},
					"Translation":
					{
						"Text": "UnLua 编辑器"
					},
					"Key": "UnLuaEditorSettingsName"
				},
				{
					"Source":
					{
						"Text": "UnLua Editor Settings"
					},
					"Translation":
					{
						"Text": "UnLua 编辑器设置"
					},
					"Key": "UnLuaEditorSettingsDescription"
				},
				{
					"Source":
					{
						"Text": "Unbind"
					},
					"Translation":
					{
						"Text": "解绑"
					},
					"Key": "Unbind"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FUnLuaEditorCommands",
					"Children": [
						{
							"Source":
							{
								"Text": "About"
							},
							"Translation":
							{
								"Text": "关于"
							},
							"Key": "About"
						},
						{
							"Source":
							{
								"Text": "About this version"
							},
							"Translation":
							{
								"Text": "关于当前版本"
							},
							"Key": "About_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Bind"
							},
							"Translation":
							{
								"Text": "绑定"
							},
							"Key": "BindToLua"
						},
						{
							"Source":
							{
								"Text": "Copy as Relative Path"
							},
							"Translation":
							{
								"Text": "复制相对路径"
							},
							"Key": "CopyAsRelativePath"
						},
						{
							"Source":
							{
								"Text": "Copy module name as relative path."
							},
							"Translation":
							{
								"Text": "复制模块名的相对路径"
							},
							"Key": "CopyAsRelativePath_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Create Lua Template"
							},
							"Translation":
							{
								"Text": "创建Lua模版文件"
							},
							"Key": "CreateLuaTemplate"
						},
						{
							"Source":
							{
								"Text": "Create an issue on github"
							},
							"Translation":
							{
								"Text": "在Github上提交问题"
							},
							"Key": "ReportIssue_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Create lua template file"
							},
							"Translation":
							{
								"Text": "创建Lua模版文件"
							},
							"Key": "CreateLuaTemplate_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Generate IntelliSense"
							},
							"Translation":
							{
								"Text": "生成智能提示"
							},
							"Key": "GenerateIntelliSense"
						},
						{
							"Source":
							{
								"Text": "Generate intelliSense files"
							},
							"Translation":
							{
								"Text": "生成智能提示数据文件"
							},
							"Key": "GenerateIntelliSense_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Hot Reload"
							},
							"Translation":
							{
								"Text": "热重载"
							},
							"Key": "HotReload"
						},
						{
							"Source":
							{
								"Text": "Hot reload all lua states"
							},
							"Translation":
							{
								"Text": "热重载所有Lua环境"
							},
							"Key": "HotReload_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Implement UnLuaInterface"
							},
							"Translation":
							{
								"Text": "实现UnLuaInterface"
							},
							"Key": "BindToLua_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Open Editor Settings"
							},
							"Translation":
							{
								"Text": "打开UnLua编辑器设置"
							},
							"Key": "OpenEditorSettings"
						},
						{
							"Source":
							{
								"Text": "Open UnLua Editor settings"
							},
							"Translation":
							{
								"Text": "打开UnLua编辑器设置"
							},
							"Key": "OpenEditorSettings_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Remove the implementation of UnLuaInterface"
							},
							"Translation":
							{
								"Text": "移除UnLuaInterface"
							},
							"Key": "UnbindFromLua_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Report issue"
							},
							"Translation":
							{
								"Text": "提交问题"
							},
							"Key": "ReportIssue"
						},
						{
							"Source":
							{
								"Text": "Reveal in Explorer"
							},
							"Translation":
							{
								"Text": "在资源管理器中显示"
							},
							"Key": "RevealInExplorer"
						},
						{
							"Source":
							{
								"Text": "Reveal lua file in explorer"
							},
							"Translation":
							{
								"Text": "在资源管理器中显示Lua文件"
							},
							"Key": "RevealInExplorer_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Unbind"
							},
							"Translation":
							{
								"Text": "解除绑定"
							},
							"Key": "UnbindFromLua"
						}
					]
				}
			]
		},
		{
			"Namespace": "UnLuaAboutScreen",
			"Children": [
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "Close"
					},
					"Key": "Close"
				},
				{
					"Source":
					{
						"Text": "Copyright (C) 2019 THL A29 Limited, a Tencent company. All rights reserved."
					},
					"Translation":
					{
						"Text": "Copyright (C) 2019 THL A29 Limited, a Tencent company. All rights reserved."
					},
					"Key": "Copyright3"
				},
				{
					"Source":
					{
						"Text": "Tencent is pleased to support the open source community by making UnLua available."
					},
					"Translation":
					{
						"Text": "Tencent is pleased to support the open source community by making UnLua available."
					},
					"Key": "Copyright2"
				},
				{
					"Source":
					{
						"Text": "Version: {0}"
					},
					"Translation":
					{
						"Text": "Version: {0}"
					},
					"Key": "VersionLabel"
				},
				{
					"Source":
					{
						"Text": "https://github.com/Tencent/UnLua"
					},
					"Translation":
					{
						"Text": "https://github.com/Tencent/UnLua"
					},
					"Key": "Copyright1"
				}
			]
		},
		{
			"Namespace": "UnLuaConsoleCommands",
			"Children": [
				{
					"Source":
					{
						"Text": "Runs the given module path in lua env."
					},
					"Translation":
					{
						"Text": "在Lua环境中执行指定路径的模块"
					},
					"Key": "CommandText_DoFile"
				},
				{
					"Source":
					{
						"Text": "Runs the given string in lua env."
					},
					"Translation":
					{
						"Text": "在Lua环境中执行指定的代码文本"
					},
					"Key": "CommandText_Do"
				}
			]
		},
		{
			"Namespace": "UnLuaIntelliSenseGenerator",
			"Children": [
				{
					"Source":
					{
						"Text": "Generating Blueprints InstelliSense"
					},
					"Translation":
					{
						"Text": "生成智能提示数据文件"
					},
					"Key": "GeneratingBlueprintsIntelliSense"
				}
			]
		},
		{
			"Namespace": "UnLuaMainMenuToolbar",
			"Children": [
				{
					"Source":
					{
						"Text": "About"
					},
					"Translation":
					{
						"Text": "关于"
					},
					"Key": "About"
				},
				{
					"Source":
					{
						"Text": "About UnLua"
					},
					"Translation":
					{
						"Text": "关于UnLua"
					},
					"Key": "AboutUnLua"
				},
				{
					"Source":
					{
						"Text": "Action"
					},
					"Translation":
					{
						"Text": "动作"
					},
					"Key": "Section_Action"
				},
				{
					"Source":
					{
						"Text": "Generate IntelliSense"
					},
					"Translation":
					{
						"Text": "生成智能提示"
					},
					"Key": "GenerateIntelliSense"
				},
				{
					"Source":
					{
						"Text": "Help"
					},
					"Translation":
					{
						"Text": "帮助"
					},
					"Key": "Section_Help"
				},
				{
					"Source":
					{
						"Text": "Hot Reload"
					},
					"Translation":
					{
						"Text": "热重载"
					},
					"Key": "HotReload"
				},
				{
					"Source":
					{
						"Text": "Report Issue"
					},
					"Translation":
					{
						"Text": "提交问题"
					},
					"Key": "ReportIssue"
				},
				{
					"Source":
					{
						"Text": "Settings"
					},
					"Translation":
					{
						"Text": "设置"
					},
					"Key": "OpenEditorSettings"
				},
				{
					"Source":
					{
						"Text": "UnLua"
					},
					"Translation":
					{
						"Text": "UnLua"
					},
					"Key": "UnLua_Label"
				},
				{
					"Source":
					{
						"Text": "UnLua"
					},
					"Translation":
					{
						"Text": "UnLua"
					},
					"Key": "UnLua_ToolTip"
				}
			]
		}
	]
}